{"podcast_details": {"podcast_title": "Closing Bell", "episode_title": "Closing Bell Overtime 8/18/23", "episode_image": "https://image.simplecastcdn.com/images/91198a9a-b3b9-4946-a1e3-5a87b0d28f63/08c89b73-1a41-4ee6-9add-19e21551502f/3000x3000/cb-ot-3000x3000-combo-1.jpg?aid=rss_feed", "episode_transcript": " Looking like a flat close for the S&P 500 here. A stock settle maybe a level around 43.71. The Nasdaq dipping down slightly. The Dow finishing the day up slightly. But all of the major averages that you just heard Scott say finishing markedly lower on the week. That is the scorecard on Wall Street. The action though is just getting started. Welcome to Closing Bell Overtime. I'm Morgan Brennan. John Fort is off today. A rare Friday afternoon earnings release is coming your way. Palo Alto Networks due to report results any moment. And the stock has hit a rough patch down around 16 percent this month. We'll bring you the numbers as soon as they cross. And later, California real estate mogul Rick Caruso joins us with his read on the commercial property market as rising rates raise some red flags for investors and developers. His insights on retail too. But first, let's begin with our market panel as we cap off a rough week on Wall Street. Joining us now is Citi U.S. equity strategist Scott Kroener. Scott, great to have you on. Your thoughts about the market at this level right now. So so we recently raised our target from a longstanding four thousand up to forty six hundred. The view was at that point that we had to price in or acknowledge the soft landing possibility increasing. At the same time, we were busy raising earnings estimates for the balance of this year for the S&P and out to the the balance of twenty four as well. So from our perspective, we've been in the mode for the past month or so of looking for a pullback to be more aggressive in. We're kind of laying out forty two forty three hundred as a range where we get more constructive on the on a new entry point for the S&P. OK, we're still above that forty three seventy one. It looks like here we finished the day just under a point higher for the S&P. What what do you get constructive on when we start hitting those levels, the market more broadly or other specific sectors? So the way it's going to play out, we've been saying for a while now, we're we're very comfortable with the growth side of the ledger longer term. We do think there's a new driver in town via A.I., but we're we're looking for pullbacks to buy into. So we've been saying look for pullbacks on growth, put new money to work on cyclicals. That's more or less played out as you as this soft landing discussion has taken hold here. As we pull back, I think we're going to be much more balanced in how we see the opportunity setting up. The framework here very simply is fundamentals are getting better in our view. You round trip the move off of the late May rally in the S&P, which was a combination of growth and a I promise, along with an economic sensitive push on soft landing and your risk reward just sets up in our view much more constructively for the broader market in general. Yeah, just digging through your notes here on sectors looks like you're steering clear financials, but that you do like real estate. Why so real estate, you know, our view all year has been that the negative impact of rising rates got got priced in last year. We know that we're dealing with a a an issue within the broader real estate market, particular to the office sector. But when you look at the composition of the real estate or the REITs within the S&P 500, you get a much higher quality component there. You get the companies that are either data center plays. They played to the the tower component of REITs. And what I'm going to say, you know, the industrial component as well. So when we look at S&P 500 REITs, we think the setup fundamentally is pretty constructive here. And again, we think at the margin we end up benefiting as we get to a peaking Fed over the next several months. And we've seen the 10 year yield shoot higher this week. If we not only retest the October highs, but we push through them, say, does that change the thesis at all? So when we said, look, we're raising our target, prepare for a pullback. I got asked the question, OK, so what's going to trigger a pullback in front and center was, heck, the market had gotten comfortable with a three and a half to four percent 10 year for the better part of this year as the Nasdaq was rallying. And so our perspective was very simply, you take some of the attention away from AI, you put it on a different angle. And in this case, you you look at rising interest rates through a four percent nominal on the 10 year and you begin to reinsert this valuation issue. So four and a quarter, maybe to go into four and a half. We think that that is what actually helps trigger a valuation compression off the move we've had. House view here is that we still end of the year with 10 years in the closer to three sixty five range. Interesting. And it looks like you've upped your target since the start of the month as well for twenty twenty four. Why is it the soft landing thesis? It's it's it's partially soft landing. It's also higher base on earnings. What we're really kind of digging in on here is going to be somewhat contrarian that we're looking for more defined earning acceleration next year. We think we can get 13, 14 percent earnings growth out of the S&P. That's going to be a combination of a higher starting point combined with more confidence in a softest landing scenario. And then at the same time, what you get is a mean reversion in some sectors where earnings this year are under pressure. And so you can think energy in that regard, health care in that regard, perhaps even financials. We think a normalization of earnings across sectors next year can also provide a tailwind more broadly for S&P earnings growth. OK, I just want to note that Palo Alto Networks results are out. We're going through the results right now. Initial stock looks like a pop here. And after hours trading, we'll bring you those numbers momentarily. In the meantime, Scott, one final question looking to next week, everybody's talking about it. Jackson Hole, what's Pal going to say? Your thoughts? Well, I think, you know, I think there's no question you got to dig in here on they need to see ongoing evidence that that inflation continues to decelerate. It appears to us that the numbers are pointed in that direction. Is it fast enough for the Fed and their expectations set up here? It's a big question, Mark. I think it just it makes sense that you're going to continue to lay on a thesis that, hey, we're aware of global issues. And you can think of China exporting deflation in that in that context. But we still need to see this through and get confident that we've kind of slayed this this inflation issue. So I think higher for longer continues to be the mantra here. But what we've been focusing on more and more is the 10 year nominals and in and related to 10 year reels as opposed to Fed funds. I think investors are pretty confident that we're closer to the end of the Fed cycle. And what really becomes important for my perch anyway, is the read through to longer term inflation reads that kind of keeps a boundary on 10 year yields. So we're not sweating valuation as we go forward. OK, Scott Kronert, thanks for kicking off the hour with me. You bet. We mentioned it. Palo Alto earnings are out. Christina Parts and Evelis has the numbers. Hi, Christina. The most anticipated earnings report on a Friday afternoon. EPS beat at a dollar forty four adjusted. The street was anticipating a dollar twenty eight. So that's stronger. But when we talk about revenues for Q4, we'll say it's basically in line, maybe a touch lower one point nine five three billion. The street was anticipating one point nine five six billion. It's the Q1 revenue guidance that is coming in a little bit light at one point eight two to one point eight five billion. And yet the stock is reacting over five percent higher. There is one quote here that stood out to me in here from the CFO saying our billings this quarter didn't fully capture that strength. We continue to make great progress in our financial transformation. Speaking of billings in Q4, it did grow 18 percent year over year. So that was slightly higher than what the street was anticipating. So it could be contributing to that stock jump, given the weakness that we saw with Fortinet and the fact that they guided lower. A lot of that had to do with billings. And yeah, that's it for now. So the stock up over five percent EPS beat revenues in line. Q1 revenue guidance a little light. Got it. Of course, we've got to buckle our seat belts for what's going to be a two hour conference call. Kicking off here. Two hours and one on one conversations with sell side analysts should they have any questions? And rumor has it there's a sales meeting this Sunday, but I haven't proved that just yet. OK, maybe there's a lot going on. All right. Sounds like you got a busy couple hours yet to go here, Christina. Thank you. Don't miss Jim Kramer's exclusive interview with Palo Alto CEO Monday at six p.m. Eastern on Mad Money. All right. Let's bring in JMP securities. Trevor Walsh for more on Palo Alto. Trevor, your thoughts. What's what's sending the stock higher? Is it is a sigh of a relief, a sigh of relief that like there's not bad news or more bad news here? Yeah, Morgan, thanks for having me. I think that's probably the gist of it. The investor sentiment kind of heading into the print was definitely airing on the negative side, just based on this more peculiar Friday scheduling management kind of noted that there was some scheduling conflicts or at least some a lot of things coming together with their sales kickoff schedule for next week. And so it was more just to nothing, nothing necessarily negative, just more of that. Although we'll see what they have to say on the upcoming analyst call for the back half of the earnings call. What's the key question you're going to ask? We've been getting a lot of questions around the product revenue line specifically, which really reflects their firewall performance. The typical refresh cycle for those normally lasts around 18 months. And we've already seen now pretty much 24 or eight quarters, 24 months of solid performance, double digit growth on that end. Before the refresh really started, they were hovering right around more single digit, three percent type of growth rates on that product revenue line. So investors are just kind of wondering how much is really left in the tank there and whether the the kind of more software parts of the business will actually be able to kind of pick up the slacks once that once that refresh cycle ends. Gotcha. OK. And then I guess in terms of in terms of you mentioned hardware, I mean, there's been some talk that maybe they're going to start to wind down further the hardware piece, the business and lean and harder to software. Your thoughts? Yeah, they've always really been leaning, I think the CEO, Mr. Arora, has really kind of helped to transform this this company and away from a hardware company into a software company. So I think that's been part of the story for a while. So I think, yeah, I think we'll certainly be watching to see that refresh cycle and the product revenue growth sort of starts to slow down. But I think from when you see how well positioned Palo Alto is across their kind of primary pillar areas, whether it's what they're doing within zero trust, within cloud security or even extended detection response, the software story is strong. And those are all three really big areas of growth that growth that we're watching a lot. So I think they're they're well positioned to, I think, have that software, those line items really, really power through as the as the product line item kind of slows down a little bit here. Yeah, I mean, as you're talking, the stock is moving higher. It's now up eight percent. And after I was trading, you had an outperform rating on the stock. We've seen a double digit pull pullback since the start of the month. Do you buy at these levels still? Yeah, absolutely. And I think in all fairness, with a lot of the names in our coverage, I've seen a similar kind of pullback over just the last few weeks, notwithstanding Palo Alto's again, more curious announcement on the second to have a Friday earnings call, which I think left some investors on the fence. I think this is still still a great buying point. The our three hundred dollar price target is still kind of well within the realm of where our comps for the group on a free cash flow basis are trading now currently. So I think it's even with this kind of pop, I think it's we like Palo Alto going forward, like I said, great software story, main kind of marquee name within cybersecurity. So I think all systems are go, especially I think what hopefully will not be any kind of significant negative news coming out of the the analysts did the analyst call today. Gotcha. And we know you'd be tuning in as as many others will. And of course, getting longer term guidance on that call and maybe some more color ahead of this annual sales kickoff meeting next week. Trevor, thanks for joining us with Realtime Reaction to Palo Alto Networks. Let's turn now to senior markets commentator Michael Santoli, who is here at headquarters today. He's taking a look at the damage done in the S&P 500 in this August sell off. We're talking technicals. We are a couple percent this week, Morgan, even though we kind of went in flat on the day. The S&P 500 at the lows of the day, just over forty three thirty ish. It was right around a zone that a lot of folks were looking at as a potential downside target. It sort of goes back to late June where that that July kind of melt up type market got started. Also, if you want to take it all the way back to like one year and a couple of days, it was the August high of last year when J. Powell Jackson Hall kind of threw some cold water on the market. Now, it definitely is the case that we broke this uptrend coming off of the March lows after the regional bank stress. So you're going to have to sort of rebuild in here. I wouldn't say that today's calm index performance necessarily meant that this little selling storm or this turbulence August and September is over. But it's done some work in getting sentiment and positioning and valuation off the recent heights that were such a concern back in July. Now, take a look at the long term treasuries. Normally we look at these things in yield terms. Here's the price of the TLT, the 20 plus year maturity treasury bonds. And, you know, you kind of see at least vaguely the opportunity being an interesting spot where it did bottom back in late 2022. So that means that's when rates did peak right there. The other thing to keep in mind is so we basically have long rates at levels we saw several months ago. Markets have separated from bonds. They are a good deal higher than they were back at the October lows. But recently, as we've made new highs and yields, this has been a pressure point. So we'll see. I don't know if it's of technical significance, but it is the case that value is getting built up in the long end of the Treasury. Kurt, I would argue, curve Morgan, because you have real yields that are solidly positive right now. That generally means you're getting compensated to some degree for taking that risk. So the idea being that maybe you see more demand move back into move back into, for example, the 10 year Treasury because of that. Yes. I mean, over time, obviously, we don't know what the magic level is. But, you know, today we saw a little bit of a pause in the yield move right around four and a quarter on the 10 year. So we'll see if that is where we have a little bit of an equilibrium point between supply and demand. All right, Mike, we'll see you later this hour. It's good to have you here in the house. Good to be up next. The bankruptcy of China's real estate giant Evergrande is just the latest crack emerging in that country. So is China even investible anymore? We're going to discuss that question next over time. Back into. Welcome back to overtime. China's property giant Evergrande filing for bankruptcy protection in a U.S. court. This filing comes amid fears that China's real estate troubles could spill over into other parts of the economy, which has already seen signs of a slowdown. What does this mean for investors? Well, joining me now is NWI managing director of Global Macro Research Tara Hariharan and Kuhn Foundation chairman Robert Kuhn. He's a longtime adviser to China's leaders and multinational corporations. It's so great to have both of you here to break this down. Thanks for joining me, Robert. I'm going to start with you, I guess, just especially since the data can be a little opaque and not always the most realistic, at least how Wall Street interprets it with China, I guess, just set the stage for me in terms of what's happening in real time in the country. There's a confluence of issues, a perfect storm coming off of covid three years of lockdowns, the uneasy breaking with it. Consumer confidence is very low. And then all of the issues having to do with real estate, what we see in the property giants Evergrande, Country Garden, the trust companies, China has a long history of shadow banking in one form or another with wealth management products being managed and trust funds. I think there's something close to three trillion dollars in in trust accounts in China. And a healthy percentage of that is exposed to real estate. Real estate is also important because it has been the traditional funding for local governments, which have been under tremendous stress. And there's great amount of debt, which we've heard about building up independent of all these other issues. You have everything coming together now. Real estate is key and consumer confidence. China's leaders have known this for a long time. They had a meeting in last December. They went through five or six critical categories. I covered that extensively and real estate and consumer confidence were really at the top of the list. It's important to note that China's leaders economically are very competent people. They always have been. The difference now is that there is political stability of a kind that we've not seen in our lifetime. Now, some people might think that's not good because they all all the people are related to Xi Jinping. I take a contrarian position. These people are Li Chong, the premier ran Shanghai, Jiangsu, he was governor of Zhejiang province. Altogether, you put the GDPs, that would be like the fifth largest country in the world. Very sensitive to entrepreneurship, working with foreign businesses. So you have a very competent team, but they have their work cut out for them. We can discuss the details. OK, first, Tara, I want to bring you into the conversation here as well, because investors, at least here in the US, have been very keen to see what this is going to mean in terms of stimulus response from the government in China as well. And we've gotten some smaller actions, but nothing that's been overwhelming or as large as has been anticipated. So what does that mean in terms of investability right now and how to be positioned on a global stage? Thank you so much, Morgan. And I think Robert summed up the issues in China very beautifully. As I've been predicting since my first CNBC appearance back last December, China stimulus measures don't seem like they will suffice to stem an economic slowdown and the mounting financial risks as discussed in the property and the trust sectors. This is because all of the easing so far hasn't really been able to address the key issues of very weak consumer sentiment and credit demand. And that includes the rate cuts or even local government bond issuance. So we at NWI now see a significant risk that the next tool that China uses to try to support its economy is actually currency devaluation. In 2015, they engineered a large depreciation of the yuan, and they could do it again, basically to achieve two things. First of all, to get more export competitiveness. They're already competing against a very weak Japanese yen. And also they could just do it to try to increase inflation at a time when the CPI in China has gone deflationary. So we, for instance, are positioned by trading short the CNH, the offshore Chinese currency. This trade is also supported by the fact that the realities of U.S.-China geopolitical tensions and also the growth and interest rate differentials mean that there are very wide yield gaps between the U.S. and China, and these are all reasons why the currency, the Chinese currency, should continue to depreciate. We also think that it's perfectly possible that China chooses no longer to intervene to support the currency and basically use up FX reserves, but instead that they try this bazooka by basically trying to devaluate. OK, Robert, I want to pick up where you left off as well, especially on a day where the headline in The Wall Street Journal is investors fear China's Lehman moment is looming. Sure, I mean, that's a natural response after the Evergrande bankruptcy. But many people don't agree with that. Let me just respond a little bit to the previous analysis. China is supporting the currency right now. China likes to undermine bears whenever they see foreign investors going in bearish direction. They like to feed them sufficient losses so that they can never guess properly. So right now there is a significant defense of the of the yuan. Also, in terms of a stimulus is a very important point that's made because I think that is the key to watch. I would expect that there will not be a major stimulus as part of the package because that adds to the long term debt and really kicks the can down the road. And the can gets bigger and more volatile in the past. It would have been done if we were two years ago preparing for the 20th Party Congress with some very critical decisions. China leadership would want not there to be a serious downturn and would turn to a major stimulus. But I don't think they will now. If they do, that's a sign that they believe things are really bad. So I think the the the the standard for what it will take to have a major stimulus is very high. If we see it, that's a signal that there's real trouble. I don't expect that China is making a significant effort to defend the yuan. It is also passing various laws to make it more attractive for foreign businesses, foreign businesses. Rightly so, we're very concerned, but there's a whole series of very specific programs that are and policies that have been announced to support foreign businesses. So this is a sign that China is going to want to use all the levers that it has. OK, sure. All right. Some key insights there. Thank you so much for joining me, Robert Kuhn and Tara Hariharan bonds bond yields, pausing their feverish rise today. But the recent spike in put it is putting it's Friday, folks. I'm going to get through this read. You're ready. The recent spike in bond yields is putting pressure on one vulnerable part of the market in particular. We are going to explain that next and take another look at shares of Palo Alto Networks. That earnings call kicks off in just a moment. We're going to bring any headlines that emerge. The shares are now at nine percent. We'll be right back. Welcome back to overtime. Treasure yields are pulling back today, but the 10 year yield touch levels this week that haven't been seen in years. That spike is putting pressure on an already vulnerable part of the market. Leslie Picker has that story for us. Leslie. Hey, Morgan. Yeah, the duration is a big impact. The jump in yields having an adverse effect on bank capital, particularly for regional banks at a time when they really can't afford it. Since the end of June, the move on the seven year has resulted in a 60 basis point hit to aggregate capital ratios for the three dozen banks between 100 billion and 700 billion dollars in assets, kind of those larger regionals. That's according to exclusive data we commissioned from Goldman Sachs. The move in the seven year amounts to an estimated dent worth 12 billion to capital just in the last six weeks and a 10 percent impact to book value, Goldman said. The impact is more pronounced for regionals than it is for the largest U.S. banks because essentially they manage their securities portfolio differently or they have in the current environment. Higher rates are starting to have an impact on margins as depositors seek higher earnings on their cash and banks tighten their lending standards. And capital is already under siege with the prospect for additional regulation with looming capital requirements that are much higher than current levels. So altogether, this explains you can see there the Kare down six point three percent just in the last week, Morgan, because of this confluence of headwinds. But really the seven year yield is kind of what's driving some of these recent moves. Interesting. I mean, we don't really talk about the seven year yields. We don't. I had to make sure we had it in our system, actually, so that we could show a chart. When you talk about the fact that regional banks are managing their securities portfolios differently than maybe some of the some of the bigger banks, is that is how is how they're managing changing in real time, too? Well, it is because of the prospect for regulations that would change the accounting standards for these. If you recall the available for sale securities, that was the whole thing with Silicon Valley Bank. That was largely because some of these regionals, especially in that that window of 100 billion or more, you know, that weren't seen as systemically important firms. They don't have to necessarily mark they're available for sale securities as part of something that would impact capital. And so therefore, those securities, they may have taken a little bit more duration on those, especially when interest rates were lower in a way to kind of get more yield. Whereas now, you know, the environment's so different. So obviously, they're being more affected by this than some of the bigger banks that may not have had as much of an ability to take that duration. All right. Leslie Picker, always bringing us the latest accounting Friday evening. Well, it's the latest and greatest insights on the bank beat. Nobody does it better. Thank you for being here. Thanks, Morgan. All right. Well, it's time now for CBC News Update with Pippa Stevens. Hi, Pippa. Hey, Morgan, a historic agreement announced this afternoon at Camp David. President Biden and the leaders of Japan and South Korea pledged to expand military and economic ties, saying the goal of the agreement is to enhance peace and stability in the region. The three leaders also joined in condemning China for its, quote, dangerous and aggressive behavior in the region. New York City is considering housing migrants in a jail that shut down after Jeffrey Epstein's suicide. Senior counsel for the city's law department wrote a proposal suggesting several sites where migrants could be housed, including the jail. The city needs to shelter an estimated 10,000 migrants. And spam is donating over two hundred and sixty thousand cans valued at more than one million dollars to help victims of the Maui wildfire spam and its parent company Hormel Foods will deliver the donation to a relief organization. The meat has been a staple in Hawaiian cooking since World War Two. The companies said the donation is one way of showing the community love and support back. Morgan, and our prayers and wishes are with everybody there as well. Pippa Stevens, thank you. Well, we just told you about the impact of higher rates on regional banks and coming up, we're going to look at the impact on real estate, specifically commercial real estate, when we're joined by real estate mogul Rick Caruso. And after the break, talk about an activist steak, the parent company of Outback Steakhouse becoming the latest target of activist investor Starboard Value. We're going to tell you all about that move when overtime returns. Welcome back. Palo Alto earnings call is underway. The stock is seeing big gains in after hours. It's up about eight and a half, almost nine percent right now. You did see and we'll call it a mixed earnings report with top line essentially in line, maybe slightly light, but an EPS beat. And the full year, the fiscal year guidance coming in stronger on the earnings side and a little bit lighter on the revenue piece. But it looks like billings for the current quarter as well were in line or better. Well, we're going to bring any headlines as they come. Shares of Blumen Brands meantime, though, blossomed today after Starboard Value disclosed it owns nine percent of those shares. It comes as sales growth at Blumen has stalled. The company's recent earnings earlier this month showed a zero point eight percent increase in same store sales. But data shows a bounce back in overall restaurant sales. Mike Santoli is going to break it down for us. I'm Mike. Yeah, Morgan, economy wide restaurant sales have really accelerated in the last couple of years. We know about that with the reopening of the economy. This is a long term look from the official government retail sales figures of restaurants and bars. Total revenues you see going back 10 years. And we've basically kind of bent the former trend line higher. This is about a 10 percent annualized rate of sales in the last two years. Before that, it was closer to six, seven percent. A lot of that's inflation, of course, but still goes to the benefit of restaurants. So, yeah, I mentioned Blumen Brands kind of a quiet, very slow, sort of steady operator in casual dining. Although this move here, the news that starboard is involved, did get the stock popping above the broader S&P 500 restaurant group performance on this two year basis. And this is the overall equal weighted consumer discretionary area. So you see restaurants in general over this period of time have separated to the upside from broad consumer discretionary. So we'll see. I mean, it's there's a lot of questions around whether it's the right part of the restaurant industry to really be betting on casual as opposed to quick service and all the rest of it. But interesting move nonetheless. All right. Come on over here. I want to chat this out for two is table. That was very clever. Yes. Table for two. I always feel like I'm a game show host when I'm bringing you back up here on set. I just look at this chart. It's pretty clear, right, that it's been underperforming recently. We don't necessarily know, at least according to reports, what what starboard is fermenting for in terms of change at the company to try and see, I guess, a reigniting of same store sales. But in general, to your point, casual dining and some of these chains have had such an incredibly strong year. Yes, they've had a strong year. We I guess the question is whether, in fact, this huge pivot to service spending and eating out. There was also a bit of an advantage when grocery prices were going up. And so eating at home was more expensive. So on a relative basis, it makes sense to go out. The casual sit down restaurant sector is very tough because there still is this kind of value orientation. They still try to deliver at a pretty contained price point. So Starboard has that history with Darden restaurants. It was also a multi chain company where they basically would, you know, do everything, decide how to execute better, how to staff restaurants and how to set up the menus. Also, where to put capital, where to pull it out of in terms of within the network. Yeah, it was interesting, too, because we got retail earnings from names like Target and Wal-Mart. And to your point, what you are starting to see is potentially more people making more purchases that signal more eating at home as that inflation equation inverts. Exactly. And, you know, the whole bookcase behind this phenom stock like Cava is it's not only in kind of the right part of the industry in terms of kind of quick serve, also healthy, also Mediterranean. And all of that kind of excludes much of the sit down casual dining sector, right, which sort of value steakhouse outback, things like that. All right, Mike, thank you. See you later. Up next, billionaire real estate investor Rick Caruso on how rising interest rates are impacting his sprawling commercial real estate empire. Stay with us. Welcome back. Rising interest rates continue to weigh on the commercial real estate sector. Mortgage rates are sitting at their highest level in over 20 years. But according to Douglas Ellman, executive chairman Howard Lorber, there is one bright spot in commercial real estate. Here's what he told me yesterday in the Hamptons. Commercial side of market is very tough. The office leasing retail is picked up, OK, because restaurants have reopened and stores are doing OK. And that's probably the one shining point right now. Well, joining us now is Caruso founder and executive chairman Rick Caruso's properties include the Grove and the Americana shopping centers in Los Angeles. Rick, it's great to have you back on the show. Thank you, Morgan. Thanks for having me. Good to see you. I do want to start with your reaction to what Howard, Howard Lorber had had to say and what you're seeing. Well, Howard's a smart guy. I always like hearing what Howard has to say. And I agree. Retail is strong. I know from our own properties, our traffic across our portfolio is up. We're up double digits. The consumer continues to be spending money and we don't see any weakness in sight. So we're pleased. We're pleased with our sales per square foot and the retail growth that we see happening out there with the retailers. Are you surprised to see to see it so resilient consumers still so so ready to spend right now and to go out to places? I am actually Morgan, I'm a little bit more cautious maybe than others because I do worry about the impact on the rising interest rates. I think at some point in time, it's got to impact the consumer out there at some level. But we're just not seeing it yet. I think there was so much money put into the economy for so many years. Savings are still relatively high and people, I think, post covid are enjoying being out, spending, shopping and dining. So I think it's going to continue at least through the end of the year from what we're seeing in our forecasts. Yeah. And we talk a lot about housing rents, especially because it feeds into CPI in such an outsized way. But what are you seeing in terms of those retail rents and other types of property rents right now? We've got we've got real growth in retail rents. So as our space has become available, we've had significant growth. But that's all tied into sales because you can't raise your retail rent unless you've got the sales per square foot to support that. Right. You know, there's a metric retailers could only spend so much and still be profitable. The right properties and there's certainly a flight to quality, which we're getting the benefit of the right properties and the right retailers are spending the money on the right stores and locations because it's driving sales. And people want to shop local. People want to be close to their homes. People want to be in an area that's safe. Our environments are safe and friendly. And they're actually not designed for shopping. They're designed for people to come and enjoy themselves. And then they shop and then they dine. So it's a little bit different formula that we have, but it's paying off very well. Yeah. I wonder what you think about the lending environment right now, because we've seen signs that bank credit is tightening. We know that private credit seems to be having a moment with the Apollos and Blackstones of the world being able to step into a variety of sectors right now. What are you seeing in the L.A. market and the rest of California where you operate? I think it's tough in the office sector, like Howard said, I think it's very tough in the retail sector. Listen, rates are higher. I don't like the higher rates. The reality is that rates are higher. The 10 years, you know, is at an all time high. That's impacting everybody. Lenders have widened their spreads. It's created an opportunity for private lending. And that's going to continue to grow, I think, for the near term. But the cost of capital is up and everybody, including ourselves, has got to reorganize and adjust their businesses to deal with the increased costs and also inflation. Although the rate of inflation is down, the increases we're living with. So we're doing a lot of thinking about how we're reforming the company, reforming our expenses to be much more profitable in an environment that is more expensive to operate in. Yeah, I just wonder if there are any potential knock on effects or unintended consequences of the pain that we're starting to in almost slow motion see royal office real estate specifically in some of these major markets, the poor quality office real estate, as some developers are now handing back the keys, for example, to some of their buildings to banks. Well, I think there are. I mean, one of the things that I don't like saying, I wish the Fed would just take a pause and let time come through and see what the impacts are to the increased rates and if inflation is going to really be at the level we want and the economy has slowed down. But the impact on these office buildings, I'm not smart enough to figure out, Morgan, what the next generation of office buildings are going to look like, how you reuse these office buildings and core downtowns like L.A., San Francisco are just getting decimated. You know, we've got a 20 percent vacancy in downtown L.A. Now, part of that is because of the homeless problem. Part of that is because of crime still embedded in Los Angeles, which is a problem. Part of that is back to work. But a lot of these buildings are just antiquated and probably they're going to end up coming down and then rebuilt for another purpose. And it may be residential, which probably makes the most sense. But converting them, as you know, is really expensive. And we don't see a lot of that happening, at least in L.A., that I'm aware of. Yeah. And this is this is the conversation I had with Lorber as well in terms of particularly the New York metro market. So certainly something we're seeing across the country right now. Rick Caruso, great to get your thoughts. Thanks for joining me. Thanks, Morgan. Have a good weekend. You too. The Fed kicks off its annual Jackson Hole Economic Symposium next week. Up next, we will discuss what's at stake for interest rates, the economy, the market, your wallet. Welcome back to Overtime. Next week's annual Fed Symposium in Jackson Hole comes at an uncertain time for the market and the economy, as questions linger about whether or not the Fed really has inflation under control and if rate hikes are really on pause. Joining us now is Tim Dewey, SGH Macro Advisors Chief U.S. Economist. Tim, it's great to have you back on. What do you think? Is the Fed on pause or done? I think the Fed would like to think they're on pause. I think the problem for the Fed is that the growth forecast is going to come in higher than they expected. And it's going to leave them less confident that the disinflation that we're seeing in the economy right now is going to be able to be sustained into 2024. I mean, we've already heard some prospective soft landing commentary from certain Fed officials in recent weeks. Expectation about how Chair Powell is going to thread the needle between, as you mentioned, the resilient economic data that we've been getting and the fact that inflation does seem to still be or is still higher than where the Fed would like to see it. Right. So, you know, when I look at the options for Powell this week, what strikes me is it's not very clear that they have to say anything to dramatically change market expectations. The market has 10 basis points priced in roughly for further rate hikes. So it doesn't have fully priced in another rate hike, which would be consistent with the story that we're getting out of the SEP and we're getting out of Fed speakers that maybe there's still more to be done. And there's rate cuts priced in for next year, which is consistent with the SEP. And I don't know if we can say yes or no. Those things are definitely going to happen or not going to happen at this point. So I think that market pricing is actually pretty well aligned with the Fed right now. And so Powell can really kind of continue with much of the story that Fed speakers have been have been discussing. And that's we might be near the top. We're becoming more confident that inflation is going to be on a trajectory we're hoping for. We're coming a little more cognizant of dual risks of both sides of the mandate. But at the same time, I do think that they have to account for the fact that growth does look like it's coming in quite a bit stronger than implied in the last summary of economic projections. And I think what they believed at the July FOMC meeting. OK, I'm going to ask a little bit of a contrarian question because we know disinflation is afoot right now. But I mean, you look at something like real estate, for example, commercial real estate. If you see those prices start to fall and fall dramatically or other or other types of assets or parts of the parts of the market from a price standpoint, do we are we closer to the possibility of deflation than we realize? I don't think we're close to a deflationary, disinflationary, deflationary episode. Certainly, there are parts of the market that you mentioned, CRE, that currently could experience some price declines here, given the fact that nobody's going to the office as much as they used to. So that's different, though, than sort of general economy wide deflation. I think that really the stage is set for not going too far below two percent. In fact, I think I would not be too I'm not as optimistic about the inflation outlook as maybe the market is. I think you've got plenty of room really to see some firmer inflation numbers later in 2024. OK, Tim Dewey of SGH Macro Advisors, thanks for joining me. My pleasure. Anytime. Palo Alto Networks holding on to big gains after hours. Let's get back to Christina Parts-Navalis with headlines from the earnings call. Christina. Well, the CEO did confirm what I reported earlier. The Friday call is so they can have one on one calls with analysts over the weekend so they can update their models and also have new guidance ahead of their big sales meeting on Sunday. But the CEO did say they like the attention. What stood out is the CFO did bring up two main points impacting their business. First, the rising cost of capital means customers want to hold cash and defer payments. So that means the percent of bookings that include deferred payments actually increased approximately 45 percent year over year. The second impact to their business, they are seeing a more normalized growth rate for the industry. They they point out that they just went through covid, the reopening after covid when everybody played catch up buying hardware and software and then the aftermath of the supply chain issues. Now they expect to see a normalized growth rate for hardware in somewhere between the low to mid single digits. The stock, though, still up over eight percent, almost nine percent higher after the company bumped its full year guidance for both earnings and billings. A key metric. Morgan. All right, Christina. Thank you. Thanks. Up next, a look ahead to one earnings report that all of Wall Street will be watching next week. And don't forget to catch the latest episode of my podcast, Manifest Space. This week, I talked to commercial astronaut and tech billionaire businessman Jared Isaacman about SpaceX's reported turn to profitability and so much more, including his own next venture to space. You can listen wherever you get your podcasts. Welcome back to overtime. A number of results on the docket next week you can see right there on your screen. But the big one that everybody will be watching is Nvidia, which is up nearly two hundred percent this year. Mike Santoli is back with us. I mean, this has been one of the magnificent sevens. And yes, I realize it's been under a little bit of pressure recently, but man, it's been the A.I. play of the year. Hasn't given back much of those gains. I mean, what? It's only a trillion dollar company where two percent of the S&P trading at 40 plus times earnings that everybody thinks holds the future in its hand. So what's the big deal? It's very interesting how people believe whether the reaction is a reflex disappointment or confirming everybody's bullish hopes that somehow it's going to be the signature swing factor in the markets from here on out. Either creates a little bit of a washout to the downside after the final favorite falls or something. I'm not sure exactly that's the case if it's the linchpin for the overall market, but I do think it's going to set the kind of A.I. narrative on its next phase. And I think the big question is going through next year, because, by the way, next year already expecting just massive earnings and sales ramps. It's to me it's is this a multi year story or is it just going to be a build out followed by digestion for the whole industry? Yeah. And of course, Nvidia had such a huge beat in the last earnings. Shocked everybody. So I feel like the bar is kind of high as the numbers are going up. The stock probably hangs in there, but we'll see. All right. Well, don't forget, you can catch much more of Mike Santoli along with Josh Brown tonight at six p.m. on Staking Top Staking Stock, she said. And what some are calling an insightful escapade, a thought provoking frolic and inspiring scamper through the minds of two of America's thought leaders. It's getting better reviews than the Barbie movie. So says the teleprompter is culturally important. I was going to say, who are the some who are saying let's get them out here anyway. I appreciate the the the enthusiastic support should be should be fun. There was plenty to kick around this week. So we'll do that. We'll break it all down later. OK. Tune in. In the meantime, the markets finished the day mixed but much lower for the week. That's going to do it for us here at Overtime. Fast money begins right now."}, "podcast_summary": "On this episode of Overtime, key insights and takeaways include:\n\n- The market panel discussed the recent rough week on Wall Street, with the major indices finishing markedly lower. The Citi U.S. equity strategist mentioned that they have raised their target for the S&P 500 and are looking for a pullback to be more aggressive in buying. They believe that fundamentals are getting better and expect a new driver in town via artificial intelligence (AI).\n- The panel also discussed the real estate market, with a focus on the negative impact of rising interest rates. However, they are optimistic about the REITs within the S&P 500, as they believe the setup is fundamentally constructive and that there is more confidence in a softest landing scenario.\n- Palo Alto Networks reported its earnings, with EPS beating expectations and revenues coming in line or slightly lower. The company's CFO mentioned that billings didn't fully capture the sales strength. Investors reacted positively to the earnings release, and the stock saw a pop in after-hours trading.\n- The impact of rising rates on regional banks was highlighted, with the recent spike in bond yields putting pressure on bank capital ratios. This could have potential implications for lending and the overall performance of the sector.\n- Real estate mogul Rick Caruso provided insights into the commercial real estate market. He mentioned that retail is strong, and the consumer continues to spend money despite the rising interest rates. However, he expressed caution regarding the potential impact of higher rates in the future.\n- The upcoming Fed Symposium in Jackson Hole was discussed, with expectations that the Fed may adjust its economic projections based on stronger-than-expected growth. The market pricing is well aligned with the Fed's current stance, and Chair Powell is expected to maintain a similar narrative in his speech.\n- Palo Alto Networks held its earnings call, confirming that the Friday afternoon release was to allow for one-on-one calls with analysts over the weekend. The company mentioned the impact of rising cost of capital on customers, leading to more deferred payments. They also discussed a more normalized growth rate for the industry and the increasing importance of private lending due to widening spreads.\n- The stock market performance, particularly in the retail and AI sectors, was highlighted. Nvidia's upcoming earnings report, its performance as an AI play, and its potential impact on the market were discussed. The bar is set high for Nvidia following its massive beat in the previous earnings release.\n\nOverall, the market panel discussed the challenges and opportunities in the current market environment, with a focus on sectors such as real estate, technology, and retail.", "podcast_guest": {"name": "Scott Kroener", "org": "", "title": "", "summary": "Not Available"}, "podcast_highlights": "In the podcast episode, \"Closing Bell Overtime,\" the highlights are as follows: \n\n- The S&P 500 closed relatively flat, while the Nasdaq dipped slightly and the Dow finished slightly higher. However, all major averages finished the week markedly lower.\n- Palo Alto Networks, a California-based cybersecurity company, was due to report earnings results during the episode. The stock had hit a rough patch, down around 16% for the month.\n- California real estate mogul Rick Caruso joined the podcast to discuss the commercial property market and the impact of rising rates on investors and developers.\n- The episode featured a market panel discussion with Citi U.S. equity strategist Scott Kroener, who shared his thoughts on the market and his outlook for the S&P 500.\n- The panel discussed sectors to watch, with a focus on growth and cyclicals. They also discussed the prospects for real estate and the impact of rising interest rates.\n- Other topics covered include the upcoming Jackson Hole Economic Symposium, the prospects for a soft landing in the market, and the overall strength of the retail sector.", "podcast_topics": "In this podcast episode, key topics and themes discussed include:\n\n1. Market performance: The episode starts with a discussion on the performance of major stock market indices, particularly the S&P 500, Nasdaq, and Dow. The overall sentiment is that the week has been rough for Wall Street.\n\n2. Earnings release: Palo Alto Networks is set to report its earnings results, and the stock has experienced a decline of around 16% for the month. The episode anticipates the release of the numbers and discusses the potential impact on the stock.\n\n3. Market panel: City U.S. equity strategist Scott Kroner joins the discussion as part of the market panel. He shares his thoughts on the market at its current level and provides insights on potential entry points for new investments.\n\n4. Real estate market: Scott Kroner discusses the positive outlook for real estate, particularly in the REITs (Real Estate Investment Trusts) sector. He highlights the higher quality components within the S&P 500 REITs and the potential benefits of a peaking Fed and rising interest rates on the real estate market.\n\n5. Jackson Hole Symposium: The discussion shifts to the upcoming Jackson Hole Economic Symposium and the expectations for Federal Reserve Chair Jerome Powell's speech. The focus is on the need for ongoing evidence of decelerating inflation and the possibility of a valuation compression triggered by rising interest rates.\n\n6. Palo Alto Networks earnings release: Palo Alto Networks releases its earnings results, with an EPS beat and revenue in line with expectations. The stock experiences a significant increase in after-hours trading.\n\n7. Commercial real estate: Billionaire real estate investor Rick Caruso joins the episode and discusses the impact of rising interest rates on the commercial real estate sector. He acknowledges the strength of retail and an increase in retail rents, but expresses caution about the potential long-term impact of higher interest rates.\n\n8. Fed Symposium and interest rates: The discussion turns back to the upcoming Jackson Hole Symposium and the Fed's stance on interest rates. The expectation is that the Fed will maintain its pause on rate hikes, but the stronger-than-expected growth forecast may lead to less confidence in sustained disinflation.\n\n9. Nvidia earnings: The episode concludes with a preview of Nvidia's upcoming earnings release, which is highly anticipated in the market due to the company's significant gains and its role in the AI industry. The discussion revolves around the potential impact on the AI narrative and the question of whether this is a multi-year story or a short-term build-out followed by digestion for the industry."}